Курс_EDT_задание_501/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курс_EDT_задание_501/src/Documents/Продажи/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СоставЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество*ТекДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество*ТекДанные.Цена;
КонецПроцедуры
